Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителят отваря екрана за вход в системата
    When Потребителят въведе e-mail "ivan@gmail.com"
    And Въведе парола "Pass123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение за вход "Успешно влязохте в системата!"
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителят отваря екрана за вход в системата
    When Потребителят въведе e-mail "ivangeorgiev@gmail.com"
    And Въведе парола "Pass5123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение за вход "Грешни данни!"
    
    